<?php

$code = $_POST['code'];

if ($code == '') {

}
$result = '{
	"message": "ok",
	"nu": "3346226611625",
	"ischeck": "1",
	"condition": "F00",
	"com": "shentong",
	"status": "200",
	"state": "3",
	"data": [{
		"time": "2017-12-03 12:26:15",
		"ftime": "2017-12-03 12:26:15",
		"context": "杭州市 房东代签-已签收，感谢您选择申通快递，期待再次为您服务。",
		"location": ""
	}, {
		"time": "2017-12-03 06:19:37",
		"ftime": "2017-12-03 06:19:37",
		"context": "杭州市 浙江杭州滨江公司(0571-28081888/13989834498)-汽运部T(15336583778)-派件中",
		"location": ""
	}, {
		"time": "2017-12-03 06:17:39",
		"ftime": "2017-12-03 06:17:39",
		"context": "杭州市 已到达-浙江杭州滨江公司",
		"location": ""
	}, {
		"time": "2017-12-03 02:25:07",
		"ftime": "2017-12-03 02:25:07",
		"context": "杭州市 浙江杭州中转部-已发往-浙江杭州滨江公司",
		"location": ""
	}, {
		"time": "2017-12-01 09:36:11",
		"ftime": "2017-12-01 09:36:11",
		"context": "郑州市 河南郑州新航空部-已发往-浙江杭州中转部",
		"location": ""
	}, {
		"time": "2017-12-01 09:35:52",
		"ftime": "2017-12-01 09:35:52",
		"context": "郑州市 已到达-河南郑州新航空部",
		"location": ""
	}, {
		"time": "2017-11-30 13:13:12",
		"ftime": "2017-11-30 13:13:12",
		"context": "郑州市 河南郑州公司(0371-58631333)-何泽占-已收件",
		"location": ""
	}]
}';

if ($code == '123') {
    echo $result;
} else {
    echo '{"msg":" 该单号暂无物流进展，请稍后再试，或检查公司和单号是否有误","status":"-2"}';
}